PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tcpwm_quaddec.h
/***************************************************************************//**
* \file cy_tcpwm_quaddec.h
* \version 1.80
*
* \brief
* The header file of the TCPWM Quadrature Decoder driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2025 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#if !defined(CY_TCPWM_QUADDEC_H)
#define CY_TCPWM_QUADDEC_H

#include "cy_tcpwm.h"

#ifdef CY_IP_MXTCPWM

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_tcpwm_quaddec
* Driver API for Quadrature Decoder.
*
* The functions and other declarations used in this part of the driver are in cy_tcpwm_quaddec.h.
* You can also include cy_pdl.h to get access to all functions and declarations in the PDL.
*
* A quadrature decoder is used to decode the output of a quadrature encoder.
* A quadrature encoder senses the position, velocity, and direction of
* an object (for example a rotating axle, or a spinning mouse ball).
* A quadrature decoder can also be used for precision measurement of speed,
* acceleration, and position of a motor's rotor, or with a rotary switch to
* determine user input.
*
* The Quadrature Decoder has the following features:
* * 16- or 32-bit Counter.
* * Period Register. This is only available in TCPWM Version 2.
* * Range 0, Range 0 Compare, Range 1 capture, Range 1 Compare Quadrature modes. This is only available in TCPWM Version 2.
* * Counter Resolution of x1, x2, x4, and up/down rotary the frequency of the phiA (Count) and
* phiB (Start) inputs. Up/Down rotary resolution is only available in TCPWM Version 2
* * Interrupt on Terminal Count and Compare or Capture 0. Interrupt on Compare or Capture 1 is only available in TCPWM Version 2.
* * Index Input to determine absolute position
* * A positive edge on phiA increments the counter when phiB is 0 and decrements
* the counter when phiB is 1
* * Two programmable trigger outputs, trig_out0 and trig_out1 that generate a
* trigger on one of the following events Overflow, Underflow, Terminal Count,
* and Compare Match 0/1. The available triggers are dependent on the QuadDec mode.
* All these features are only available in TCPWM Version 2.
* * TC (cc_match) trigger output is only available in TCPWM Version 1.
* * Second Compare Match (CC_MATCH1) event is only available in TCPWM Version 2.
*
* \section group_tcpwm_quaddec_configuration Configuration Considerations
*
* The QuadDec configuration can be divided to number of sequential
* steps listed below:
* * \ref group_tcpwm_quaddec_config
* * \ref group_tcpwm_quaddec_clock
* * \ref group_tcpwm_quaddec_enable
* * \ref group_tcpwm_quaddec_start
*
* \subsection group_tcpwm_quaddec_config Configure Quadrature
* To configure Quadrature, provide the configuration parameters in the
* \ref cy_stc_tcpwm_quaddec_config_t structure. The Configuration structure
* can be modified through software, but if the configurator in ModusToolbox is used
* then the configuration structure will be updated with the users input. To initialize
* the driver, call \ref Cy_TCPWM_QuadDec_Init function providing a pointer to the populated
* \ref cy_stc_tcpwm_quaddec_config_t structure.
*
* For TCPWM V1 Configuration
* \snippet tcpwm/quaddec/snippet/main.c snippet_Cy_TCPWM_V1_QuadDec_Init
*
* For TCPWM V2 Configuration
* \snippet tcpwm/quaddec/snippet/main.c snippet_Cy_TCPWM_V2_QuadDec_Init
*
* \subsection group_tcpwm_quaddec_clock Assign Clock Divider
* The clock source must be connected to proper working.
* Any of the peripheral clock dividers could be used. Use the
* \ref group_sysclk driver API to do that.
*
* \subsection group_tcpwm_quaddec_enable Enable Quadrature Decoder
* Quadrature has to be enabled before starting
*
* \snippet tcpwm/quaddec/snippet/main.c snippet_Cy_TCPWM_QuadDec_Enable
*
* \subsection group_tcpwm_quaddec_start Start Quadrature Decoder
* Quadrature has to be started
*
* \snippet tcpwm/quaddec/snippet/main.c snippet_Cy_TCPWM_QuadDec_Start
* \{
*/

/**
* \defgroup group_tcpwm_macros_quaddec          Macros
* \defgroup group_tcpwm_functions_quaddec       Functions
* \defgroup group_tcpwm_data_structures_quaddec Data Structures
* \} */

/**
* \addtogroup group_tcpwm_data_structures_quaddec
* \{
*/

/** Quadrature Decoder configuration structure */
typedef struct cy_stc_tcpwm_quaddec_config
{
    /** Selects the quadrature encoding mode. See \ref group_tcpwm_quaddec_resolution */
    uint32_t    resolution;
    /** Enables an interrupt on the terminal count, capture or compare. See \ref group_tcpwm_interrupt_sources */
    uint32_t    interruptSources;
    /** Configures how the index input behaves. See \ref group_tcpwm_input_modes */
    uint32_t    indexInputMode;
    /** Selects which input the index uses. The inputs are device-specific. See \ref group_tcpwm_input_selection */
    uint32_t    indexInput;
    /** Configures how the stop input behaves. See \ref group_tcpwm_input_modes */
    uint32_t    stopInputMode;
    /** Selects which input the stop uses. The inputs are device-specific. See \ref group_tcpwm_input_selection */
    uint32_t    stopInput;
    /** Selects which input the phiA uses. The inputs are device specific. See \ref group_tcpwm_input_selection */
    uint32_t    phiAInput;
    /** Selects which input the phiB uses. The inputs are device specific. See \ref group_tcpwm_input_selection */
    uint32_t    phiBInput;
#if (CY_IP_MXTCPWM_VERSION >= 2U)
    /** Configures how the phiA input behaves. See \ref group_tcpwm_input_modes */
    uint32_t    phiAInputMode;
    /** Configures how the phiB input behaves. See \ref group_tcpwm_input_modes */
    uint32_t    phiBInputMode;
    /**  Sets the QuadDec mode */
    uint32_t    quadMode;
    /**  Sets the period0 of the pwm */
    uint32_t    period0;
    /** Specifies index or wrap-around capture function*/
    bool        captureOnIndex;
    /** Sets the value for Compare 0 */
    uint32_t    compare0;
    /** Sets the value for the buffered Compare 0 */
    uint32_t    compareBuf0;
    /**  If enabled, the compare 0 values are swapped on the terminal count */
    bool        enableCompare0Swap;
    /** Sets the value for Compare 1 */
    uint32_t    compare1;
    /** Sets the value for the buffered Compare 1 */
    uint32_t    compareBuf1;
    /** If enabled, the compare1 values are swapped on the terminal count */
    bool        enableCompare1Swap;
    /** Configures how the capture 0/index 1 input behaves.*/
    uint32_t    capture0OrIndex1InputMode;
    /** Selects which input the capture 0/index 1 uses. The inputs are device-specific. */
    uint32_t    capture0OrIndex1Input;
    /** Configures how the capture1 input behaves. */
    uint32_t    capture1InputMode;
    /** Selects which input the capture 1 uses. The inputs are device-specific. */
    uint32_t    capture1Input;
    /** Configures which internal event generates on output trigger 0. */
    uint32_t    trigger0Event;
    /** Configures which internal event generates on output trigger 1. */
    uint32_t    trigger1Event;
#endif /* (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN) */
#if defined (CY_IP_MXS40TCPWM) || defined (CY_DOXYGEN)
    bool        buffer_swap_enable; /**< Configures swapping mechanism between CC0 and buffered CC0, CC1 and buffered CC1, PERIOD and buffered PERIOD, DT and buffered DT  */
#endif /* defined (CY_IP_MXS40TCPWM) || defined (CY_DOXYGEN) */
} cy_stc_tcpwm_quaddec_config_t;
/** \} group_tcpwm_data_structures_quaddec */

/**
* \addtogroup group_tcpwm_macros_quaddec
* \{
* \defgroup group_tcpwm_quaddec_mode QuadDec Mode
* \{
* The quadrature decoder mode.
*/
/** Counter Range between 0x0000 and 0xFFFF / 0xFFFFFFFF (for GRP_CNT_WIDTH = 16 / 32) */
#define CY_TCPWM_QUADDEC_MODE_RANGE0                (0U)
/** Counter Range0 with a compare function */
#define CY_TCPWM_QUADDEC_MODE_RANGE0_CMP            (1U)
/** COUNTER range is between 0x0000 and PERIOD with 1 or 2 Capture functions */
#define CY_TCPWM_QUADDEC_MODE_RANGE1_CAPT           (2U)
/** Same as QUAD_RANGE1_CAPT with 1 or 2 Compare functions */
#define CY_TCPWM_QUADDEC_MODE_RANGE1_CMP            (3U)
/** \} group_tcpwm_quaddec_mode */

/**
* \defgroup group_tcpwm_quaddec_resolution QuadDec Resolution
* \{
* The quadrature decoder resolution.
*/
#define CY_TCPWM_QUADDEC_X1                         (0U)    /**< X1 mode */
#define CY_TCPWM_QUADDEC_X2                         (1U)    /**< X2 mode */
#define CY_TCPWM_QUADDEC_X4                         (2U)    /**< X4 mode */
#define CY_TCPWM_QUADDEC_UP_DOWN_ROTARY_COUNT       (3U)    /**< Up/Down Rotary mode */
/** \} group_tcpwm_quaddec_resolution */

/**
* \defgroup group_tcpwm_quaddec_capture_mode QuadDec CaptureMode
* \{
* The quadrature capture modes.
*/
#define CY_TCPWM_QUADDEC_CAPTURE_ON_INDEX            (0U)   /**< Capture on Index */
#define CY_TCPWM_QUADDEC_CAPTURE_ON_WRAP_AROUND      (1U)   /**< Capture on Wrap Around */
/** \} group_tcpwm_quaddec_capture_mode */

/** \defgroup group_tcpwm_quaddec_status QuadDec Status
* \{
* The quaddec status.
*/
#define CY_TCPWM_QUADDEC_STATUS_DOWN_COUNTING       (0x1UL)        /**< QuadDec is down counting */
#define CY_TCPWM_QUADDEC_STATUS_UP_COUNTING         (0x2UL)        /**< QuadDec is up counting */
#if (CY_IP_MXTCPWM_VERSION >= 3U) || defined (CY_DOXYGEN)
#define CY_TCPWM_QUADDEC_STATUS_CC0_READ_MISS       (0x4UL)        /**< QuadDec is miss reading the last capture0 event */
#define CY_TCPWM_QUADDEC_STATUS_CC1_READ_MISS       (0x8UL)        /**< QuadDec is miss reading the last capture1 event */
#define CY_TCPWM_QUADDEC_STATUS_KILL                (0x10UL)       /**< QuadDec has active kill event */
#endif /* (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN) */
#define CY_TCPWM_QUADDEC_STATUS_COUNTER_RUNNING     (0x80000000UL) /**< QuadDec the counter is running */
/** \} group_tcpwm_quaddec_status */


